[
    {
        "id": 1,
        "name": "Tanjiro Kamado",
        "age": 16,
        "gender": "Male",
        "race": "Human",
        "description": "Is the main protagonist of Demon Slayer. He joined the Demon Slayer Corp to find a remedy to turn his sister, Nezuko Kamado, back into a human and to hunt down and kill demons.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/1.webp",
        "affiliation_id": 1,
        "arc_id": 1,
        "quote": "Work at it. All I can do is work hard! That´s the story of my life!"
    },
    {
        "id": 2,
        "name": "Nezuko Kamado",
        "age": 14,
        "gender": "Female",
        "race": "Demon",
        "description": "She is a demon and the younger sister of Tanjiro Kamado and one of the two remaining members of the Kamado family. Formerly a human, she was attacked and transformed into a demon by Muzan Kibutsuji.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/2.webp",
        "affiliation_id": 1,
        "arc_id": 1,
        "quote": "Humans are to be protected and saved... I will never hurt them."
    },
    {
        "id": 3,
        "name": "Giyu Tomioka",
        "age": 21,
        "gender": "Male",
        "race": "Human",
        "description": "He is a Demon Slayer of the Demon Slayer Corps and the current Water Hashira. He has a reserved personality and a very strong sense of justice.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/3.webp",
        "affiliation_id": 2,
        "arc_id": 1,
        "quote": "Feel the rage. The powerful, pure rage of not being able to forgive will become your unswerving drive to take action."
    },
    {
        "id": 4,
        "name": "Sakonji Urokodaki",
        "age": 70,
        "gender": "Male",
        "race": "Human",
        "description": "Sakonji Urokodaki is a retired member of the Demon Slayer Corps, having held the position of the previous Water Hashira. He is the main cultivator of the Water Breathing style, having trained Makomo, Sabito, Giyu Tomioka, and Tanjiro Kamado.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/4.webp",
        "affiliation_id": 3,
        "arc_id": 1,
        "quote": "Remember to take a long breath so the oxygen flows into every cell in your body."
    },
    {
        "id": 5,
        "name": "Sabito",
        "age": 13,
        "gender": "Male",
        "race": "Human",
        "description": "Sabito was a former apprentice of Sakonji Urokodaki. He appeared to assist Tanjiro Kamado in his preparations for the Final Selection exam.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/5.webp",
        "affiliation_id": 1,
        "arc_id": 1,
        "quote": "You have to make sure you never forget any of the secrets Urokodaki taught you! Pound it into the marrow of your bones!"
    },
    {
        "id": 6,
        "name": "Makomo",
        "age": 12,
        "gender": "Female",
        "race": "Human",
        "description": "Makomo and Sabito were both orphaned from their respective families and adopted by Sakonji, who trained them both and permitted them to attend the Demon Slayer Corps´Final Selection.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/6.webp",
        "affiliation_id": 1,
        "arc_id": 1,
        "quote": "Train until it kills you. Because really, when you get down to it, there´s nothing else you can do."
    },
    {
        "id": 7,
        "name": "Hand Demon",
        "age": 47,
        "gender": "Male",
        "race": "Demon",
        "description": "The Hand Demon was the primary antagonist of the Final Selection Arc of Demon Slayer. He was a notorious demon who killed thirteen of Sakonji Urokodaki´s apprentices",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/7.webp",
        "affiliation_id": 6,
        "arc_id": 1,
        "quote": "I´ve been here so long... that dynasties have risen and fallen! Again and again! All while I´ve been trapped here! Unforgivable! Unforgivable!"
    },
    {
        "id": 8,
        "name": "Genya Shinazugawa",
        "age": 16,
        "gender": "Male",
        "race": "Human",
        "description": "He is the younger brother of the Wind Hashira and as one of the five that survived Final Selection, Genya possesses a relatively strong foundation as a Demon Slayer even without utilizing a Breathing Style.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/8.webp",
        "affiliation_id": 1,
        "arc_id": 1,
        "quote": "I´ll do it. I´m gonna do it. I have to do it. Think only about winning. I will not let my brother, or my master, or any of my comrades die!"
    },
    {
        "id": 9,
        "name": "Zenitsu Agatsuma",
        "age": 16,
        "gender": "Male",
        "race": "Human",
        "description": "Zenitsu Agatsuma is one of the main characters of Demon Slayer and along with Inosuke Hashibira, a travelling companion of Tanjiro Kamado and Nezuko Kamado. He is also a Demon Slayer in the Demon Slayer Corps.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/9.webp",
        "affiliation_id": 1,
        "arc_id": 1,
        "quote": "I hate myself more than anyone. I always think I have to get my act together, but I end up cowering, running away, sniveling. I want to change. I want to be a competent person."
    },
    {
        "id": 10,
        "name": "Inosuke Hashibira",
        "age": 15,
        "gender": "Male",
        "race": "Human",
        "description": "Inosuke is short-tempered, confrontational, abrasive and proud. He always likes to think he is the strongest fighter in a situation, constantly challenging most people he comes across and wanting others to respect and praise him for his skill.",
        "img": "https://www.demonslayer-api.com/api/v1/characters/images/10.webp",
        "affiliation_id": 1,
        "arc_id": 1,
        "quote": "Everything that dies returns to the earth, but crying won´t bring any of them back, so no matter how frusturated you feel, don´t cry!"
    }
]